# optionally use this file to define connection settings for sets of servers.
# --> it will then be available for use by any block.
# --> the alternative is to define the connection settings in the block's json defintion (inline).
# [1] duplicate this file and rename it suitably.
#     --> e.g. cluster_acme_preprod.json.
# [2] in this duplicated file, for each server in a set, define a connection settings json block.
#     --> a tag used to identify the server.
#     --> the ip that the machine canbe connected to over ssh.
#     --> the remote user account to connect to.
#     --> the local key location to use to connect.
#     --> the targetFolder where a bash-blocks folder containing the framework and its blocks will be created.
#     --> the installFolder where the block being run will use to install into.
#     ----> by default the installFolder is conveniently located inside the targetFolder.
#     ----> the variables used in the paths below that are resolved at runtime.
#     -------> only the use of connect_targetFolder is optional.
# [3] reference this file in the build settings of the json definition for the block that is being run.
#     --> i.e. assign the new name of this duplicated file to the build connectJson setting.
# [4] ensure matching order for the servers in this file and the block's json definition file.
# [5] finally in this duplicated file delete these instructions leaving only the json.
{
  "servers":{
    "server1":{
      "connect":{
        "tag":            "node1",
        "pubIp":          "127.0.0.1",
        "sshUser":        "USER",
        "sshKeyLocal":    "/Users/USER/.ssh/id_rsa",
        "targetFolder":   "/Users/USER/Desktop/",
        "installFolder":  "${connect_targetFolder}bash-blocks/installed-blocks/${build_block}/${build_buildFolder}/"
      }
    },
    "server2":{
      "connect":{
        "tag":            "node2",
        "pubIp":          "127.0.0.2",
        "sshUser":        "USER",
        "sshKeyLocal":    "/Users/USER/.ssh/id_rsa",
        "targetFolder":   "/Users/USER/Desktop/",
        "installFolder":  "${connect_targetFolder}bash-blocks/installed-blocks/${build_block}/${build_buildFolder}/"
      }
    }
  }
}
